-- База данных «Учет подписки на периодические печатные издания»

-- Заполнение таблиц начальным набором данных
print(N'*** Старт скрипта заполнения таблиц базы данных ***');

-- виды изданий
print(N'    Заполнение таблицы справочника ВИДЫ ИЗДАНИЙ');
insert into PubTypes ([Name]) 
values
    (N'газета'),      --  1
	(N'журнал'),      --  2
	(N'альманах'),    --  3
	(N'каталог'),     --  4
	(N'дайджест'),    --  5
	(N'реклама'),     --  6
	(N'автореферат'), --  7
	(N'сборник'),     --  8
	(N'препринт'),    --  9
	(N'тезисы');      -- 10
print('    OK' + char(13));
go

-- названия улиц
print(N'    Заполнение таблицы справочника НАЗВАНИЯ УЛИЦ');
insert into Streets ([Name])
values
    (N'ул. Садовая'),      --  1
	(N'пр. Измайлова'),    --  2
	(N'ул. Воинская'),     --  3
	(N'ул. Столичная'),    --  4
	(N'ул. Ореховая'),     --  5
	(N'пр. Радио'),        --  6
	(N'ул. Павлова'),      --  7
	(N'пр. Королева'),     --  8
	(N'пр. Николаевский'), --  9
	(N'ул. Прокатчиков'),  -- 10
	(N'бул. Пушкина'),     -- 11
	(N'пр. Мира');         -- 12
print('    OK' + char(13));
go

-- издания
print(N'    Заполнение таблицы справочника ИЗДАНИЙ');
insert into Publications (IdPubType, PubIndex, Title, Price)
values
    (1, N'Е13133', N'Известия',                         798),  --  1
	(1, N'Е27000', N'Моя семья',                        210),  --  2
	(1, N'Е19946', N'Пенсионерская правда',              63),  --  3
	(2, N'Т79943', N'Кабели и провода',                 312),  --  4
	(1, N'Е43298', N'Поиск',                            315),  --  5
	(1, N'Е50102', N'Правда',                           273),  --  6
	(2, N'Т20859', N'Космонавтика и ракетостроение',   1324),  --  7
	(1, N'И32089', N'Экономика и жизнь',                105),  --  8
	(1, N'Э87404', N'Налоги. Экономика. Финансы',       145),  --  9
	(2, N'Е71444', N'Клиническая медицина',            1125),  -- 10
	(2, N'Е26902', N'Домашний очаг',                    307),  -- 11
	(1, N'Р18060', N'РБК',                              385),  -- 12
	(2, N'Е43133', N'Юный техник',                      551),  -- 13
	(1, N'Э11750', N'Аргументы и факты',                327),  -- 14
	(2, N'Е43246', N'Мурзилка',                         322),  -- 15
	(2, N'Ц34147', N'Наука и жизнь',                    460),  -- 16
	(1, N'Е29723', N'Завалинка',                        116),  -- 17
	(2, N'Э38908', N'64-шахматное обозрение',           280),  -- 18
	(3, N'А31120', N'Альманах пеших маршрутов',        1280),  -- 19
	(1, N'Е27818', N'Травинка',                          75),  -- 20
	(2, N'Н73477', N'Морская коллекция',                516),  -- 21
	(2, N'Р70558', N'Моделист-конструктор',             448),  -- 22
	(1, N'Е29090', N'СПИД-инфо',                        315),  -- 23
	(2, N'Н70002', N'Автоматика, связь, информатика',   438),  -- 24
	(2, N'Е38850', N'Развивалки',                        68),  -- 25
	(2, N'Е99555', N'Будь здоров!',                      75),  -- 26
	(2, N'Е43039', N'Веселый затейник',                 145),  -- 27
	(2, N'Е43181', N'Черепашки-ниндзя. Играй и учись',  134),  -- 28
	(1, N'Е39803', N'Медицинский вестник Челябинска',   130);  -- 29
print('    OK' + char(13));
go

-- подписчики
print(N'    Заполнение таблицы справочника ПОДПИСЧИКИ');
insert into Subscribers (Surname, [Name], Patronymic, Passport, IdStreet, Building, Flat)
values
    (N'Юрковский',   N'Марк',      N'Максимилианович', '12 21 345671',  1,  N'13', 17),   --  1
	(N'Якубовская',  N'Диана',     N'Павловна',	       '12 21 123452',  3,  N'17', 19),   --  2
	(N'Шапиро',      N'Федор',     N'Федорович',       '12 21 456123',  4,  N'21',  8),   --  3
	(N'Вожжаев',     N'Сергей',    N'Денисович',       '12 21 123122',  2, N'187', 72),   --  4
	(N'Хроменко',    N'Игорь',     N'Владимирович',    '12 21 342121', 10, N'111', 24),   --  5
	(N'Пелых',       N'Марина',    N'Ульяновна',       '11 21 121212',  3, N'19б', 16),   --  6
	(N'Лапотникова', N'Тамара',    N'Оскаровна',       '11 21 098181',  4,  N'88', 18),   --  7
	(N'Огородников', N'Сергей',    N'Иванович',        '12 21 091911',  5, N'12в',  6),   --  8
	(N'Яйло',        N'Екатерина', N'Николаевна',      '12 21 345675',  1,  N'16', 12),   --  9
	(N'Лосева',      N'Инна',      N'Степановна',      '12 21 187651', 10, N'111', 21),   -- 10
	(N'Михайлович',  N'Анна',      N'Валентиновна',    '09 20 000122',  5,  N'88',  0),   -- 11
	(N'Тарапата',    N'Михаил',    N'Исаакович',       '09 20 001981',  7,  N'13', 12),   -- 12
	(N'Трубихин',    N'Эдуард',    N'Михайлович',      '09 21 121921',  1, N'118',  7),   -- 13
	(N'Чмыхало',     N'Олег',      N'Тарасович',       '12 20 021121',  4, N'19б', 22),   -- 14
	(N'Князьков',    N'Степан',    N'Сидорович',       '09 19 002165', 10, N'111', 18),   -- 15
	(N'Потемкина',   N'Наталья',   N'Павловна',        '09 19 002213',  8,  N'18',  0),   -- 16
	(N'Гритченко',   N'Степан',    N'Романович',       '09 19 002129',  1, N'12в', 30),   -- 17
	(N'Селиванов',   N'Александр', N'Михайлович',      '11 18 000503',  1, N'118',  0),   -- 18
	(N'Царькова',    N'Лариса',    N'Ильинична',       '11 18 000523',  7,  N'13', 22);   -- 19
print('    OK' + char(13));
go


-- доставки
print(N'    Заполнение таблицы регистра ДОСТАВКИ');
insert into Deliveries (IdSubscriber, IdPublication, DateStart, Duration)
values
    (13,  1, '2022-10-01',  3), --  1
	( 1,  5, '2022-06-01',  6), --  2
    (15,  8, '2022-10-01',  3), --  3
    (11,  1, '2022-06-01',  6), --  4
    ( 1,  9, '2022-01-01', 12), --  5
    ( 6, 16, '2023-01-01', 12), --  6
    ( 7, 28, '2023-10-01',  3), --  7
    ( 8, 19, '2023-06-01',  6), --  8
    (11, 10, '2024-01-01', 12), --  9
    ( 6,  1, '2024-01-01', 12), -- 10
	( 9,  1, '2024-01-01',  6), -- 11
	( 3, 18, '2024-01-01', 12), -- 12
	( 5, 21, '2024-01-01',  6), -- 13
	( 8, 18, '2024-06-01',  6), -- 14
	( 7,  1, '2024-01-01',  1), -- 15
	(10, 17, '2022-01-01',  3), -- 16
	( 2, 11, '2021-10-01',  2), -- 17
	( 4, 15, '2021-10-01',  3), -- 18
	( 8, 27, '2022-01-01',  3), -- 19
	(13, 13, '2021-01-01', 12), -- 20
	(10,  5, '2022-01-01',  4), -- 21
	(15,  8, '2023-01-01', 12), -- 22
	(19,  5, '2023-03-01',  3), -- 23
	( 6, 16, '2023-01-01',  2), -- 24
	( 3, 21, '2023-01-01', 12); -- 25
print('    OK' + char(13));
go

print(N'*** Финиш скрипта заполнения таблиц базы данных ***');
